JohnEquals/Embedded_Driver_Development/stm32f407xx_drivers/Src/Led_Button.c
/*
 * 002Led_Button.c
 *
 *  Created on: Oct 20, 2020
 *      Author: class
 */


#include "stm32f407xx.h"
#define HIGH 			1
#define BUTTON_PRESSED 	HIGH

void delay(void)
{
	for(uint32_t i = 0 ; i < 200000 ; i ++);
}

int main(void)
{

	GPIO_Handle_t GpioLed, GpioBtn;
	// led pin
	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GpioLed);
	// button pin
	GpioBtn.pGPIOx = GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GpioBtn);

	while(1)
	{
		if( GPIO_ReadFromInputPin(GpioBtn.pGPIOx, GpioBtn.GPIO_PinConfig.GPIO_PinMode) == BUTTON_PRESSED )
		{
			delay();
			GPIO_ToggleOutputPin(GPIOD,GPIO_PIN_NO_12);
		}
	}
	return 0;
}
